var g_status_train = {
    0:'配置中',
    1:'提交训练，正在排队',
    2:'开始训练',
    3:'训练完成',
    4:'用户中止',
    5:'超时',
    6:'执行后用户中止',
    7:'执行后异常中断'
}
//
// var g_status_monitor = {
//     0:'配置中',
//     1:'提交训练',
//     11:'正在排队',
//     21:'训练前取消',
//     22:'正在训练',
//     23:'任务超时',
//     31:'训练时中止',
//     32:'训练完成',
//     33:'异常中断'
// }

var g_status_monitor = {
    0:'初始化配置中',
    1:'正在训练',
    2:'正在训练依赖任务',
    3:'任务完成',
    4:'数据配置错误',
    5:'模型配置错误',
    6:'异常中断',
    7:'系统错误',
    8:'任务终止',
    9:'任务失败'
}


var g_status_mode = {
     0:'安防场景行人检测模型',
     1:'安防场景车辆检测模型',
     2:'安防场景非机动车检测模型',
     3:'adas场景车辆检测模型',
     4:'adas场景行人检测模型',
     5:'adas场景交通标识牌检测模型',
     6:'adas场景交通灯检测模型',
     7:'室内场景人头检测模型',
     8:'室内场景手势识别模型'
}